
/*
    TODO: HIDE, INACCESS, UNLIST?

    COMO A INTERFACE PODE ESTAR HIDDEN, VAI TER QUE TER UMA LISTA LOCAL DE INTERFACES KNOWN

    list_netdevice
    unlist_netdevice

    CMD_PHYS_SET_DONT_GET,
    CMD_PHYS_SET_DONT_LIST,
    CMD_PHYS_SET_DROP_ARP,
    CMD_PHYS_SET_DROP_IP4,
    CMD_PHYS_SET_DROP_IP6,
    CMD_PHYS_SET_DROP_8021Q,
    CMD_PHYS_SET_DROP_8021AD,
    CMD_PHYS_SET_DROP_OTHER,

    CMD_PHYS_CLR_DONT_GET,
    CMD_PHYS_CLR_DONT_LIST,
    CMD_PHYS_CLR_DROP_ARP,
    CMD_PHYS_CLR_DROP_IP4,
    CMD_PHYS_CLR_DROP_IP6,
    CMD_PHYS_CLR_DROP_8021Q,
    CMD_PHYS_CLR_DROP_8021AD,
    CMD_PHYS_CLR_DROP_OTHER,

    CMD_PHYS_MTU,
    CMD_PHYS_QUEUE_LEN,
    CMD_PHYS_HWADDR,
    CMD_PHYS_PROMISC_ON,
    CMD_PHYS_PROMISC_OFF,
*/

enum CMD {

    // PORT
    CMD_PORT_ON,
    CMD_PORT_OFF,
    CMD_PORT_GET,

    // PORTS
    CMD_PORTS_LIST,
    CMD_PORTS_CLEAR,

    // NOTE: SAME ORDER AS IN IFF_XGW*
    CMD_PHYS_ATTACH,
    CMD_PHYS_DETACH,

    CMD_PHYS_LIST,

    // SELF NODE
    CMD_SELF_SET,
    CMD_SELF_GET,

    // GWS
    CMD_GWS_INSERT,
    CMD_GWS_REMOVE,
    CMD_GWS_LIST,
    CMD_GWS_CLEAR,

    // NODE
    CMD_NODE_NEW,
    CMD_NODE_DEL,

    CMD_NODE_SET_NAME,
    CMD_NODE_SET_MTU,
    CMD_NODE_SET_CONNS_N,
    CMD_NODE_SET_SECRET,

    CMD_NODE_CLR_NAME,
    CMD_NODE_CLR_SECRET,

    CMD_NODE_ON,
    CMD_NODE_OFF,

    CMD_NODE_STATUS,
    CMD_NODE_STATS,

    // PATH
    CMD_PATH_NEW,
    CMD_PATH_DEL,

    CMD_PATH_SET_NAME,
    CMD_PATH_SET_WEIGHT_NODE,
    CMD_PATH_SET_WEIGHT_ACKS,
    CMD_PATH_SET_CLIENT,
    CMD_PATH_SET_SERVER,
    CMD_PATH_SET_TIMEOUT,
    CMD_PATH_SET_RTT_MIN,
    CMD_PATH_SET_RTT_MAX,
    CMD_PATH_SET_RTT_VAR,
    CMD_PATH_SET_DHCP,
    CMD_PATH_SET_PHYS, // SET THE PATH PHYS
    CMD_PATH_SET_TYPE, // SET THE PATH ENCAPSULATING TYPE
    CMD_PATH_SET_ETH_SRC,
    CMD_PATH_SET_ETH_DST,
    CMD_PATH_SET_VLAN_PROTO, // 8021Q / 8021AD  na verdade seria ETH PROTO, MAS SO USADO NO CASO DO VLAN
    CMD_PATH_SET_VLAN_ID,
    CMD_PATH_SET_IP4_TOS,
    CMD_PATH_SET_IP6_TOS,
    CMD_PATH_SET_IP4_TTL,
    CMD_PATH_SET_IP6_TTL,
    CMD_PATH_SET_IP4_SRC,
    CMD_PATH_SET_IP4_DST,
    CMD_PATH_SET_IP6_SRC,
    CMD_PATH_SET_IP6_DST,
    CMD_PATH_SET_UDP_SRC,
    CMD_PATH_SET_TCP_SRC,
    CMD_PATH_SET_UDP_DST,
    CMD_PATH_SET_TCP_DST,

    CMD_PATH_SET_PPP_SESSION,

    CMD_PATH_SET_IP_TOS, // PARA O CASO DO SERVER
    CMD_PATH_SET_IP_TTL,

    CMD_PATH_CLR_NAME,
    CMD_PATH_CLR_WEIGHT_NODE,
    CMD_PATH_CLR_WEIGHT_ACKS,
    CMD_PATH_CLR_DHCP,
    CMD_PATH_CLR_PHYS,
    CMD_PATH_CLR_TYPE, // UNSET THE PATH ENCAPSULATING TYPE AND CLEAR ALL INFO
    CMD_PATH_CLR_ETH_SRC,
    CMD_PATH_CLR_ETH_DST,
    CMD_PATH_CLR_VLAN_PROTO,
    CMD_PATH_CLR_VLAN_ID,
    CMD_PATH_CLR_IP4_TOS,
    CMD_PATH_CLR_IP6_TOS,
    CMD_PATH_CLR_IP4_TTL,
    CMD_PATH_CLR_IP6_TTL,
    CMD_PATH_CLR_IP4_SRC,
    CMD_PATH_CLR_IP4_DST,
    CMD_PATH_CLR_IP6_SRC,
    CMD_PATH_CLR_IP6_DST,
    CMD_PATH_CLR_UDP_SRC,
    CMD_PATH_CLR_TCP_SRC,
    CMD_PATH_CLR_UDP_DST,
    CMD_PATH_CLR_TCP_DST,

    CMD_PATH_ON,
    CMD_PATH_OFF,

    CMD_PATH_STATUS,
    CMD_PATH_STATS,

    // GLOBAL
    CMD_STATS,

    CMD_NMAP

};

#define CMDS_N (CMD_NMAP + 1)

#define C_USE_NID(C)    (((C) >= CMD_NODE_NEW && (C) <= CMD_PATH_STATS) || (C) == CMD_SELF_SET || ((C) >= CMD_GWS_INSERT && (C) <= CMD_GWS_REMOVE) || (C) == CMD_NMAP)
#define C_USE_PID(C)    ((C) >= CMD_PATH_NEW && (C) <= CMD_PATH_STATS)

#define C_USE_NODE(C) ( \
    (CMD_NODE_NEW <= (C) && (C) <= CMD_NODE_STATUS) || \
    (CMD_PATH_NEW <= (C) && (C) <= CMD_PATH_STATUS) )

#define C_USE_PATH(C) (CMD_PATH_NEW <= (C) && (C) <= CMD_PATH_STATUS)

#define C_USE_PHYS(C) ((CMD_PHYS_ATTACH <= (C) && (C) <= CMD_PHYS_DETACH) || (C) == CMD_PATH_SET_PHYS)

#define C_USE_PORTS(C) ( \
    (CMD_PORT_ON        <= (C) && (C) <= CMD_PORT_GET) || \
    (CMD_PATH_SET_UDP_SRC <= (C) && (C) <= CMD_PATH_SET_UDP_DST) )

#define C_NODE_MUST_EXIST(C) ((C) > CMD_NODE_NEW && (C) <= CMD_PATH_STATS)
#define C_PATH_MUST_EXIST(C) ((C) > CMD_PATH_NEW && (C) <= CMD_PATH_STATS)

#define C_NODE_MUST_NOT_EXIST(C) ((C) == CMD_NODE_NEW)
#define C_PATH_MUST_NOT_EXIST(C) ((C) == CMD_PATH_NEW)

#define C_NODE_MUST_BE_OFF_IDLE(C) ((C) >= CMD_NODE_DEL && (C) <= CMD_NODE_ON)
#define C_PATH_MUST_BE_OFF_IDLE(C) ((C) >= CMD_PATH_DEL && (C) <= CMD_PATH_ON)

// TODO: RELACAO TIPO DE DHCP VS TIPO DE PATH
//      VAI TER QUE FORCAR TIPO DE PATH COMPATIVEL COM O TIPO DE DHCP, E VICE-VERSA
//      COPIAR O DEV DO DHCP

enum CMD_ERRS {
    CMD_ERR_ALLOC_CONNS,
    CMD_ERR_ALLOC_NODE,
    CMD_ERR_ALLOC_SKB,
    CMD_ERR_INVALID_CONNS_N,
    CMD_ERR_INVALID_MTU,
    CMD_ERR_INVALID_NID,
    CMD_ERR_INVALID_PID,
    CMD_ERR_INVALID_DID,
    CMD_ERR_INVALID_NODE_NAME,
    CMD_ERR_INVALID_PATH_NAME,
    CMD_ERR_INVALID_PHYS,
    CMD_ERR_INVALID_DHCP_IP,
    CMD_ERR_INVALID_PORTS_N,
    CMD_ERR_INVALID_PASSWORD_LEN,
    CMD_ERR_INVALID_TYPE,
    CMD_ERR_INVALID_TOS,
    CMD_ERR_INVALID_TTL,
    CMD_ERR_INVALID_VPROTO,
    CMD_ERR_INVALID_VID,
    CMD_ERR_INVALID_SESSION,
    CMD_ERR_INVALID_WEIGHT,
    CMD_ERR_INVALID_TIMEOUT,
    CMD_ERR_INVALID_RTT,
    CMD_ERR_INVALID_RTT_VAR,
    CMD_ERR_INVALID_RTT_RANGE,
    CMD_ERR_PATH_USE_DHCP_NOT_IP,
    CMD_ERR_PATH_USE_DHCP_NOT_IP_4,
    CMD_ERR_PATH_USE_DHCP_NOT_IP_6,
    CMD_ERR_NODE_EXIST,
    CMD_ERR_NODE_DONT_EXIST,
    CMD_ERR_NODE_IS_OFF,
    CMD_ERR_NODE_IS_ON,
    CMD_ERR_NODE_IS_SELF,
    CMD_ERR_NODE_IS_STOPPING,
    CMD_ERR_NODE_NOT_CONFIGURED,
    CMD_ERR_PATH_EXIST,
    CMD_ERR_PATH_DONT_EXIST,
    CMD_ERR_PATH_IS_OFF,
    CMD_ERR_PATH_IS_ON,
    CMD_ERR_PATH_IS_STOPPING,
    CMD_ERR_PATH_NEED_NAME,
    CMD_ERR_PATH_NEED_CLT_SRV,
    CMD_ERR_PATH_NEED_TIMEOUT,
    CMD_ERR_PATH_NEED_RTT_MIN,
    CMD_ERR_PATH_NEED_RTT_MAX,
    CMD_ERR_PATH_NEED_RTT_VAR,
    CMD_ERR_PATH_NEED_PHYS,
    CMD_ERR_PATH_NEED_TOS,
    CMD_ERR_PATH_NEED_TTL,
    CMD_ERR_PATH_NEED_MAC_SRC,
    CMD_ERR_PATH_NEED_MAC_DST,
    CMD_ERR_PATH_NEED_ADDR_SRC,
    CMD_ERR_PATH_NEED_ADDR_DST,
    CMD_ERR_PATH_NEED_PORT_SRC,
    CMD_ERR_PATH_NEED_PORT_DST,
    CMD_ERR_PATH_NEED_VLAN_PROTO,
    CMD_ERR_PATH_NEED_VLAN_ID,
    CMD_ERR_PATH_NEED_PPP_SESSION, // TODO:
    CMD_ERR_PATH_NOT_SERVER,
    CMD_ERR_PATH_NOT_ETH,
    CMD_ERR_PATH_NOT_VLAN,
    CMD_ERR_PATH_NOT_PPP,
    CMD_ERR_PATH_NOT_IP,
    CMD_ERR_PATH_NOT_IP4,
    CMD_ERR_PATH_NOT_IP6,
    CMD_ERR_PATH_NOT_UDP,
    CMD_ERR_PATH_NOT_TCP,
    CMD_ERR_PHYS_IS_BAD,
    CMD_ERR_PHYS_IS_XGW,
    CMD_ERR_PHYS_NOT_FOUND,
    CMD_ERR_PHYS_NOT_HOOKED,
    CMD_ERR_GWS_FULL,
    CMD_ERR_GWS_NID_NOT_FOUND,
    CMD_ERR_GWS_NID_ALREADY,
    CMD_ERR_ALLOC_CMD,
    CMD_ERR_INVALID_CMD_CODE,
    CMD_ERR_INVALID_CMD_SIZE,
    CMD_ERR_COPY_CMD,
    CMD_ERRS_N
};

#define CMD_SIZE_MIN  1 // CODE
#define CMD_SIZE_MAX (4 + sizeof(cmd_arg_s)) // CODE | NID | PID | ARG

union cmd_arg_s {
    u8 code;
    u16 nid;
    u16 nid2;
    u8 pid;
    u8 did;
    u32 connsN;
    u16 mtu;
    u16 eProto;
    u16 vID;
    u8 tos;
    u8 ttl;
    u8 type;
    u8 weight_node;
    u8 weight_acks;
    u8 timeout; // SECONDS
    u16 rtt; // (MILLISECONDS) MIN / MAX /VAR
    char nname [NODE_NAME_SIZE]; // VAI PRECISAR DO FLAG ->SIZES
    char pname [PATH_NAME_SIZE];
    char dname [DHCP_NAME_SIZE];
    char phys [IFNAMSIZ];
    u16 ports [PORTS_N]; // TODO: PATH_PORTS_N
    u8 mac [ETH_ALEN];
    u8 addr4 [4];
    u16 addr6 [8];
    u8 password [PASSWORD_SIZE_MAX];
    u16 session; // PPP SESSION ID
};

BUILD_ASSERT(offsetof(cmd_arg_s, code)   == 0);
BUILD_ASSERT(offsetof(cmd_arg_s, ttl)    == 0);
BUILD_ASSERT(offsetof(cmd_arg_s, tos)    == 0);
BUILD_ASSERT(offsetof(cmd_arg_s, ports)  == 0);
BUILD_ASSERT(offsetof(cmd_arg_s, type)   == 0);
BUILD_ASSERT(offsetof(cmd_arg_s, vID)    == 0);
BUILD_ASSERT(offsetof(cmd_arg_s, eProto) == 0);
BUILD_ASSERT(offsetof(cmd_arg_s, mtu)    == 0);
